; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	image3 - mode
	infrared1 - mode
	infrared0 - mode
	image2 - mode
	GroundStation2 - direction
	GroundStation0 - direction
	Star7 - direction
	Star1 - direction
	Star9 - direction
	Star4 - direction
	Star8 - direction
	GroundStation6 - direction
	Star5 - direction
	GroundStation3 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 image2)
	(supports instrument1 image3)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 infrared1)
	(supports instrument3 infrared0)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 image3)
	(supports instrument4 image2)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument5 image2)
	(supports instrument5 infrared0)
	(supports instrument5 image3)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 Star8)
	(calibration_target instrument6 GroundStation6)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument7 image2)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 Star9)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star8)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 Star5)
	(supports instrument9 image2)
	(supports instrument9 image3)
	(calibration_target instrument9 Star5)
	(calibration_target instrument9 GroundStation6)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star14)
)
(:goal (and
	(pointing satellite3 Phenomenon10)
	(pointing satellite4 Star14)
	(have_image Phenomenon10 image3)
	(have_image Phenomenon11 infrared1)
	(have_image Planet12 infrared0)
	(have_image Planet13 infrared0)
	(have_image Star14 infrared1)
	(have_image Planet15 infrared1)
))

)

; plan
1. (turn_to satellite3 phenomenon10 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 phenomenon10)
   goals met: 2 of 8
2. (turn_to satellite1 groundstation0 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation0)
   goals met: 2 of 8
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 8
4. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 2 of 8
5. (turn_to satellite1 planet12 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet12)
   goals met: 2 of 8
6. (take_image satellite1 planet12 instrument3 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 3 of 8
7. (turn_to satellite1 phenomenon11 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 8
8. (take_image satellite1 phenomenon11 instrument3 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 4 of 8
9. (turn_to satellite1 phenomenon10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 8
10. (take_image satellite1 phenomenon10 instrument3 image3)
   added: (have_image phenomenon10 image3)
   goals met: 5 of 8
11. (turn_to satellite1 planet13 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet13)
   goals met: 5 of 8
12. (take_image satellite1 planet13 instrument3 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 6 of 8
13. (turn_to satellite1 planet15 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet15)
   goals met: 6 of 8
14. (take_image satellite1 planet15 instrument3 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 7 of 8
15. (turn_to satellite1 star14 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star14)
   goals met: 7 of 8
16. (take_image satellite1 star14 instrument3 infrared1)
   added: (have_image star14 infrared1)
   goals met: 8 of 8
